tefilus/MBD_PMSM/exampleSixStep/Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_ert_rtw/Copy_of_mcb_bldc_sixstep_f28069mLaunchPad.h
/*
 * File: Copy_of_mcb_bldc_sixstep_f28069mLaunchPad.h
 *
 * Code generated for Simulink model 'Copy_of_mcb_bldc_sixstep_f28069mLaunchPad'.
 *
 * Model version                  : 7.55
 * Simulink Coder version         : 23.2 (R2023b) 01-Aug-2023
 * C/C++ source code generated on : Tue May  6 16:29:29 2025
 *
 * Target selection: ert.tlc
 * Embedded hardware selection: Texas Instruments->C2000
 * Code generation objectives: Unspecified
 * Validation result: Not run
 */

#ifndef RTW_HEADER_Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_h_
#define RTW_HEADER_Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_h_
#ifndef Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_COMMON_INCLUDES_
#define Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_COMMON_INCLUDES_
#include "rtwtypes.h"
#include "c2000BoardSupport.h"
#include "F2806x_Device.h"
#include "F2806x_Gpio.h"
#include "DSP28xx_SciUtil.h"
#include "F2806x_Examples.h"
#include "IQmathLib.h"
#include "MW_SPI.h"
#endif          /* Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_COMMON_INCLUDES_ */

#include "MW_c2000ISR.h"
#include "Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_types.h"
#include "rt_nonfinite.h"
#include "rtGetNaN.h"
#include <string.h>
#include <stddef.h>
#include "zero_crossing_types.h"
#include "MW_target_hardware_resources.h"

/* Macros for accessing real-time model data structure */
#ifndef rtmGetErrorStatus
#define rtmGetErrorStatus(rtm)         ((rtm)->errorStatus)
#endif

#ifndef rtmSetErrorStatus
#define rtmSetErrorStatus(rtm, val)    ((rtm)->errorStatus = (val))
#endif

#ifndef rtmStepTask
#define rtmStepTask(rtm, idx)          ((rtm)->Timing.TaskCounters.TID[(idx)] == 0)
#endif

#ifndef rtmTaskCounter
#define rtmTaskCounter(rtm, idx)       ((rtm)->Timing.TaskCounters.TID[(idx)])
#endif

#define Copy_of_mcb_bldc_sixstep_f28069mLaunchPad_M (Copy_of_mcb_bldc_sixstep_f28_M)

extern void init_SCI(void);
extern void init_SCI_GPIO(void);
extern void config_ePWM_GPIO (void);
extern void config_ePWM_TBSync (void);
extern void config_ePWM_XBAR(void);

/* Block signals for system '<S20>/Bit Extract' */
typedef struct {
  uint16_T ShiftArithmetic;            /* '<S33>/Shift Arithmetic' */
  uint16_T A;                          /* '<S33>/Bitwise AND1' */
  uint16_T ShiftArithmetic1;           /* '<S33>/Shift Arithmetic1' */
  uint16_T B;                          /* '<S33>/Bitwise AND2' */
  uint16_T C;                          /* '<S33>/Bitwise AND3' */
  boolean_T DataTypeConversion;        /* '<S33>/Data Type Conversion' */
  boolean_T DataTypeConversion1;       /* '<S33>/Data Type Conversion1' */
  boolean_T DataTypeConversion2;       /* '<S33>/Data Type Conversion2' */
} rtB_BitExtract_Copy_of_mcb_bldc;

/* Block signals for system '<S217>/SPI Master Transfer' */
typedef struct {
  uint16_T SPIMasterTransfer;          /* '<S217>/SPI Master Transfer' */
} rtB_SPIMasterTransfer_Copy_of_m;

/* Block states (default storage) for system '<S217>/SPI Master Transfer' */
typedef struct {
  codertarget_tic2000_blocks_SPIM obj; /* '<S217>/SPI Master Transfer' */
  boolean_T objisempty;                /* '<S217>/SPI Master Transfer' */
} rtDW_SPIMasterTransfer_Copy_of_;

/* Block signals for system '<Root>/Speed Control' */
typedef struct {
  real32_T Switch;                     /* '<S232>/Switch' */
  real32_T Product;                    /* '<S287>/Product' */
  real32_T UnitDelay;                  /* '<S287>/Unit Delay' */
  real32_T Product1;                   /* '<S287>/Product1' */
  real32_T Add1;                       /* '<S287>/Add1' */
  real32_T Sum;                        /* '<S231>/Sum' */
  real32_T PProdOut;                   /* '<S273>/PProd Out' */
  real32_T Ki2;                        /* '<S231>/Ki2' */
  real32_T Integrator;                 /* '<S268>/Integrator' */
  real32_T Sum_j;                      /* '<S277>/Sum' */
  real32_T DeadZone;                   /* '<S261>/DeadZone' */
  real32_T IProdOut;                   /* '<S265>/IProd Out' */
  real32_T Switch_a;                   /* '<S259>/Switch' */
  real32_T Saturation;                 /* '<S275>/Saturation' */
  int16_T Switch1;                     /* '<S259>/Switch1' */
  int16_T Switch2;                     /* '<S259>/Switch2' */
  boolean_T DataStoreRead2;            /* '<S231>/Data Store Read2' */
  boolean_T DataStoreRead1;            /* '<S232>/Data Store Read1' */
  boolean_T LogicalOperator;           /* '<S231>/Logical Operator' */
  boolean_T RelationalOperator;        /* '<S259>/Relational Operator' */
  boolean_T fixforDTpropagationissue;/* '<S259>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1;
                                    /* '<S259>/fix for DT propagation issue1' */
  boolean_T Equal1;                    /* '<S259>/Equal1' */
  boolean_T AND3;                      /* '<S259>/AND3' */
} rtB_SpeedControl_Copy_of_mcb_bl;

/* Block states (default storage) for system '<Root>/Speed Control' */
typedef struct {
  real32_T UnitDelay_DSTATE;           /* '<S287>/Unit Delay' */
  real32_T Integrator_DSTATE;          /* '<S268>/Integrator' */
  int16_T Integrator_PrevResetState;   /* '<S268>/Integrator' */
} rtDW_SpeedControl_Copy_of_mcb_b;

/* Block signals (default storage) */
typedef struct {
  real_T PulseGenerator;               /* '<S7>/Pulse Generator' */
  real_T cu;                           /* '<S117>/Switch' */
  uint32_T DigitalInput2[2];           /* '<S206>/Digital Input2' */
  uint32_T DigitalInput3;              /* '<S206>/Digital Input3' */
  uint32_T PositionToCount;            /* '<S180>/PositionToCount' */
  uint32_T Delay;                      /* '<S180>/Delay' */
  uint32_T ShiftArithmetic;            /* '<S122>/Shift Arithmetic' */
  uint32_T ShiftArithmetic1;           /* '<S122>/Shift Arithmetic1' */
  uint32_T Sum;                        /* '<S122>/Sum' */
  uint32_T UnitDelay;                  /* '<S121>/Unit Delay' */
  uint32_T Uk1;                        /* '<S174>/Delay Input1' */
  uint32_T speedCountDelay;            /* '<S123>/speedCountDelay' */
  uint32_T Delay_c;                    /* '<S121>/Delay' */
  uint32_T Sum_o;                      /* '<S121>/Sum' */
  uint32_T Sum_o0;                     /* '<S175>/Sum' */
  uint32_T UnitDelay1;                 /* '<S175>/Unit Delay1' */
  uint32_T Max;                        /* '<S127>/Max' */
  real32_T RT1;                        /* '<Root>/RT1' */
  real32_T RT6;                        /* '<Root>/RT6' */
  real32_T RT2;                        /* '<Root>/RT2' */
  real32_T DataTypeConversion1[2];     /* '<S228>/Data Type Conversion1' */
  real32_T DataTypeConversion1_l;      /* '<S5>/Data Type Conversion1' */
  real32_T Merge1;                     /* '<S10>/Merge1' */
  real32_T DataTypeConversion4;        /* '<S113>/Data Type Conversion4' */
  real32_T DataTypeConversion;         /* '<S117>/Data Type Conversion' */
  real32_T IDC;                        /* '<S113>/Unary Minus' */
  real32_T Idc_ref;                    /* '<S8>/Abs' */
  real32_T Sign;                       /* '<S8>/Sign' */
  real32_T Sum_c;                      /* '<S15>/Sum' */
  real32_T PProdOut;                   /* '<S75>/PProd Out' */
  real32_T Kp1;                        /* '<S15>/Kp1' */
  real32_T Integrator;                 /* '<S70>/Integrator' */
  real32_T Sum_e;                      /* '<S79>/Sum' */
  real32_T DeadZone;                   /* '<S63>/DeadZone' */
  real32_T IProdOut;                   /* '<S67>/IProd Out' */
  real32_T Switch;                     /* '<S61>/Switch' */
  real32_T Speed_PU;                   /* '<S1>/Input Scaling' */
  real32_T Saturation;                 /* '<S77>/Saturation' */
  real32_T DataTypeConversion1_o[6];   /* '<S8>/Data Type Conversion1' */
  real32_T duty[6];                    /* '<S8>/Product' */
  real32_T DTC;                        /* '<S196>/DTC' */
  real32_T Product;                    /* '<S179>/Product' */
  real32_T DTC_a;                      /* '<S201>/DTC' */
  real32_T SpeedGain;                  /* '<S180>/SpeedGain' */
  real32_T Product_g;                  /* '<S183>/Product' */
  real32_T UnitDelay_i;                /* '<S183>/Unit Delay' */
  real32_T Product1;                   /* '<S183>/Product1' */
  real32_T Add1;                       /* '<S183>/Add1' */
  real32_T Switch_f;                   /* '<S185>/Switch' */
  real32_T Merge;                      /* '<S186>/Merge' */
  real32_T Numberofpolepairs;          /* '<S191>/Number of pole pairs' */
  real32_T Floor;                      /* '<S187>/Floor' */
  real32_T Add;                        /* '<S187>/Add' */
  real32_T Merge_a;                    /* '<S118>/Merge' */
  real32_T Merge1_c;                   /* '<S118>/Merge1' */
  real32_T Product_n;                  /* '<S173>/Product' */
  real32_T UnitDelay_iq;               /* '<S173>/Unit Delay' */
  real32_T Product1_n;                 /* '<S173>/Product1' */
  real32_T Add1_j;                     /* '<S173>/Add1' */
  real32_T currentSpeedData;           /* '<S126>/currentSpeedData' */
  real32_T Divide;                     /* '<S126>/Divide' */
  real32_T SpeedGain_c;                /* '<S126>/SpeedGain' */
  real32_T Merge1_k;                   /* '<S139>/Merge1' */
  real32_T Saturation_i;               /* '<S139>/Saturation' */
  real32_T Merge_aa;                   /* '<S139>/Merge' */
  real32_T countData;                  /* '<S142>/countData' */
  real32_T currentSpeedData_f;         /* '<S142>/currentSpeedData' */
  real32_T Divide_k;                   /* '<S142>/Divide' */
  real32_T countData_g;                /* '<S143>/countData' */
  real32_T previousSpeedData;          /* '<S143>/previousSpeedData' */
  real32_T Divide_ke;                  /* '<S143>/Divide' */
  real32_T currentSpeedData_k;         /* '<S143>/currentSpeedData' */
  real32_T Divide1;                    /* '<S143>/Divide1' */
  real32_T Sum_b;                      /* '<S143>/Sum' */
  real32_T Gain1;                      /* '<S143>/Gain1' */
  real32_T Sum1;                       /* '<S143>/Sum1' */
  real32_T Product_j;                  /* '<S143>/Product' */
  real32_T Merge1_p;                   /* '<S140>/Merge1' */
  real32_T Merge1_o;                   /* '<S141>/Merge1' */
  int32_T DataTypeConversion2;         /* '<S113>/Data Type Conversion2' */
  int32_T Add1_a;                      /* '<S113>/Add1' */
  int32_T Q17perunitconversion1;       /* '<S113>/Q17 per unit conversion1' */
  int32_T SpeedCount;                  /* '<S180>/SpeedCount' */
  uint16_T Divide_j;                   /* '<S216>/Divide' */
  uint16_T Divide1_m;                  /* '<S216>/Divide1' */
  uint16_T Divide2;                    /* '<S216>/Divide2' */
  uint16_T ForIterator;                /* '<S219>/For Iterator' */
  uint16_T IAIBMeasurement[2];         /* '<S219>/IA//IB Measurement' */
  uint16_T ICMeasurement;              /* '<S219>/IC Measurement' */
  uint16_T Memory;                     /* '<S226>/Memory' */
  uint16_T Sum_eu;                     /* '<S226>/Sum' */
  uint16_T Memory1;                    /* '<S226>/Memory1' */
  uint16_T Sum1_n;                     /* '<S226>/Sum1' */
  uint16_T Memory2;                    /* '<S226>/Memory2' */
  uint16_T Sum2;                       /* '<S226>/Sum2' */
  uint16_T SCIReceive[2];              /* '<S230>/SCI Receive' */
  uint16_T Output;                     /* '<S106>/Output' */
  uint16_T eQEP_o1;                    /* '<S205>/eQEP' */
  uint16_T eQEP_o2;                    /* '<S205>/eQEP' */
  uint16_T DataStoreRead;              /* '<S113>/Data Store Read' */
  uint16_T IAIBMeasurement_p[2];       /* '<S205>/IA//IB Measurement' */
  uint16_T DataTypeConversion3[3];     /* '<S108>/Data Type Conversion3' */
  uint16_T SCI_Tx_Data[4];             /* '<S9>/Merge' */
  uint16_T SCI_Tx_Iteration;           /* '<S9>/Merge1' */
  uint16_T FixPtSum1;                  /* '<S111>/FixPt Sum1' */
  uint16_T FixPtSwitch;                /* '<S112>/FixPt Switch' */
  uint16_T Switch1[6];                 /* '<S202>/Switch1' */
  uint16_T ICMeasurement_l;            /* '<S205>/IC Measurement' */
  uint16_T IndexVector;                /* '<S204>/Index Vector' */
  uint16_T Add_m;                      /* '<S204>/Add' */
  uint16_T Scale_to_PWM_Counter_PRD[6];/* '<S202>/Scale_to_PWM_Counter_PRD' */
  uint16_T Merge_g;                    /* '<S179>/Merge' */
  uint16_T Sum3;                       /* '<S193>/Sum3' */
  uint16_T Sum7;                       /* '<S193>/Sum7' */
  uint16_T DataTypeConversion1_l0;     /* '<S119>/Data Type Conversion1' */
  uint16_T DataTypeConversion2_a;      /* '<S119>/Data Type Conversion2' */
  uint16_T DataTypeConversion_a;       /* '<S158>/Data Type Conversion' */
  uint16_T Switch_m;                   /* '<S123>/Switch' */
  uint16_T DelayOneStep;               /* '<S124>/Delay One Step' */
  uint16_T watchdogcheck;              /* '<S127>/watchdog check' */
  uint16_T Sum_bk;                     /* '<S124>/Sum' */
  uint16_T Merge_f;                    /* '<S158>/Merge' */
  uint16_T Merge_n;                    /* '<S160>/Merge' */
  uint16_T Merge1_n;                   /* '<S160>/Merge1' */
  uint16_T Merge3;                     /* '<S160>/Merge3' */
  uint16_T speedcheck;                 /* '<S127>/speed check' */
  uint16_T Data[3];                    /* '<S107>/Data' */
  uint16_T Data_f[3];                  /* '<S109>/Data' */
  uint16_T Data_fw[3];                 /* '<S110>/Data' */
  int16_T DataTypeConversion2_c[2];    /* '<S228>/Data Type Conversion2' */
  int16_T DataTypeConversion_l[3];     /* '<S108>/Data Type Conversion' */
  int16_T WhileIterator;               /* '<S204>/While Iterator' */
  int16_T UnitDelay_n;                 /* '<S114>/Unit Delay' */
  int16_T Merge1_f;                    /* '<S158>/Merge1' */
  int16_T Merge2;                      /* '<S160>/Merge2' */
  uint16_T Merge_e;                    /* '<S87>/Merge' */
  uint16_T Merge_j;                    /* '<S17>/Merge' */
  int16_T Switch1_b;                   /* '<S61>/Switch1' */
  int16_T Switch2;                     /* '<S61>/Switch2' */
  boolean_T NOT;                       /* '<S7>/NOT' */
  boolean_T NOT_d;                     /* '<S215>/NOT' */
  boolean_T DataTypeConversion3_m;     /* '<S5>/Data Type Conversion3' */
  boolean_T Merge_fv[6];               /* '<S8>/Merge' */
  boolean_T DataStoreRead1;            /* '<S15>/Data Store Read1' */
  boolean_T LogicalOperator;           /* '<S15>/Logical Operator' */
  boolean_T RelationalOperator;        /* '<S61>/Relational Operator' */
  boolean_T fixforDTpropagationissue; /* '<S61>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1;
                                     /* '<S61>/fix for DT propagation issue1' */
  boolean_T Equal1;                    /* '<S61>/Equal1' */
  boolean_T AND3;                      /* '<S61>/AND3' */
  boolean_T Enable;                    /* '<S202>/Enable' */
  boolean_T DataTypeConversion4_g;     /* '<S118>/Data Type Conversion4' */
  boolean_T FixPtRelationalOperator;   /* '<S174>/FixPt Relational Operator' */
  boolean_T Merge3_p;                  /* '<S158>/Merge3' */
  boolean_T DataTypeConversion_j;      /* '<S123>/Data Type Conversion' */
  boolean_T validityDelay;             /* '<S123>/validityDelay' */
  boolean_T DelayOneStep1;             /* '<S124>/Delay One Step1' */
  boolean_T OR;                        /* '<S124>/OR' */
  boolean_T Compare;                   /* '<S128>/Compare' */
  boolean_T DataStoreRead_n;           /* '<S121>/Data Store Read' */
  boolean_T AND;                       /* '<S121>/AND' */
  boolean_T RelationalOperator_k;      /* '<S160>/Relational Operator' */
  boolean_T LogicalOperator_l;         /* '<S123>/Logical Operator' */
  boolean_T Merge_ng[3];               /* '<S90>/Merge' */
  boolean_T Merge_c[3];                /* '<S20>/Merge' */
  rtB_SpeedControl_Copy_of_mcb_bl SpeedControl;/* '<Root>/Speed Control' */
  rtB_SPIMasterTransfer_Copy_of_m SPIMasterTransfer1;/* '<S217>/SPI Master Transfer' */
  rtB_SPIMasterTransfer_Copy_of_m SPIMasterTransfer;/* '<S217>/SPI Master Transfer' */
  rtB_BitExtract_Copy_of_mcb_bldc BitExtract_i;/* '<S90>/Bit Extract' */
  rtB_BitExtract_Copy_of_mcb_bldc BitExtract;/* '<S20>/Bit Extract' */
} BlockIO_Copy_of_mcb_bldc_sixste;

